---
kind: property
id: P:Autodesk.Revit.DB.AlphanumericRevisionSettings.Suffix
source: html/6b0c1421-1317-d29e-54b2-c806a4df5bc7.htm
---
# Autodesk.Revit.DB.AlphanumericRevisionSettings.Suffix Property

The suffix string that will be appended to the number of each revision with Alphanumeric RevisionNumberingType.

## Syntax (C#)
```csharp
public string Suffix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null